<template>
  <div class="others">
    <div class="other">
      <div class="share" @click="share.show = true">
        <svg
          class="icon"
          viewBox="0 0 1024 1024"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M149.897707 387.566843l154.232099 0c49.484303 0 89.577425-40.093122 89.577425-89.577425L393.707231 143.757319C393.707231 94.273016 353.614109 54.179894 304.491005 54.179894L149.897707 54.179894c-49.484303 0-89.577425 40.093122-89.577425 89.577425l0 154.232099C60.320282 347.473721 100.774603 387.566843 149.897707 387.566843zM136.533333 143.757319c0-7.223986 6.140388-13.364374 13.364374-13.364374l154.232099 0c7.223986 0 13.364374 6.140388 13.364374 13.364374l0 154.232099c0 7.223986-6.140388 13.364374-13.364374 13.364374L149.897707 311.353792c-7.223986 0-13.364374-6.140388-13.364374-13.364374L136.533333 143.757319z"
            fill="#575B66"
          ></path>
          <path
            d="M304.491005 628.486772 149.897707 628.486772c-49.484303 0-89.577425 40.093122-89.577425 89.577425l0 154.232099c0 49.484303 40.093122 89.577425 89.577425 89.577425l154.232099 0c49.484303 0 89.577425-40.093122 89.577425-89.577425l0-154.232099C393.707231 668.579894 353.614109 628.486772 304.491005 628.486772zM317.49418 872.296296c0 7.223986-6.140388 13.364374-13.364374 13.364374L149.897707 885.66067c-7.223986 0-13.364374-6.140388-13.364374-13.364374l0-154.232099c0-7.223986 6.140388-13.364374 13.364374-13.364374l154.232099 0c7.223986 0 13.364374 6.140388 13.364374 13.364374L317.49418 872.296296z"
            fill="#575B66"
          ></path>
          <path
            d="M878.797884 54.179894l-154.232099 0c-49.484303 0-89.577425 40.093122-89.577425 89.577425l0 154.232099c0 49.484303 40.093122 89.577425 89.577425 89.577425l154.232099 0c49.484303 0 89.577425-40.093122 89.577425-89.577425L968.375309 143.757319C968.014109 94.273016 927.920988 54.179894 878.797884 54.179894zM891.801058 297.989418c0 7.223986-6.140388 13.364374-13.364374 13.364374l-154.232099 0c-7.223986 0-13.364374-6.140388-13.364374-13.364374L710.840212 143.757319c0-7.223986 6.140388-13.364374 13.364374-13.364374l154.232099 0c7.223986 0 13.364374 6.140388 13.364374 13.364374L891.801058 297.989418z"
            fill="#575B66"
          ></path>
          <path
            d="M673.997884 552.273721c19.865961 0 36.119929-15.892769 35.75873-36.119929 0-19.865961-15.892769-36.119929-36.119929-36.119929l-126.058554 0L547.578131 338.443739c0-19.865961-15.892769-36.119929-36.119929-35.75873-19.865961 0-36.119929 15.892769-36.119929 36.119929L475.338272 480.395062 96.440212 480.395062c-19.865961 0-36.119929 15.892769-36.119929 36.119929 0 19.865961 15.892769 36.119929 36.119929 36.119929l379.620459 0 0 169.04127c0 19.865961 15.892769 36.119929 36.119929 36.119929s36.119929-15.892769 36.119929-36.119929l0-169.04127L673.997884 552.634921z"
            fill="#575B66"
          ></path>
          <path
            d="M932.255379 552.273721c19.865961 0 36.119929-15.892769 35.75873-36.119929 0-19.865961-15.892769-36.119929-36.119929-36.119929l-79.825044 0c-19.865961 0-36.119929 15.892769-36.119929 36.119929 0 19.865961 15.892769 36.119929 36.119929 36.119929L932.255379 552.273721z"
            fill="#575B66"
          ></path>
          <path
            d="M511.8194 166.874074c19.865961 0 36.119929-15.892769 36.119929-36.119929L547.93933 88.855026c0-19.865961-15.892769-36.119929-36.119929-35.75873-19.865961 0-36.119929 15.892769-36.119929 36.119929l0 41.899118C476.06067 150.620106 491.953439 166.874074 511.8194 166.874074z"
            fill="#575B66"
          ></path>
          <path
            d="M511.8194 849.179541c-19.865961 0-36.119929 15.892769-36.119929 36.119929l0 41.899118c0 19.865961 15.892769 36.119929 36.119929 36.119929s36.119929-15.892769 36.119929-36.119929l0-42.260317C547.93933 865.07231 531.685362 849.179541 511.8194 849.179541z"
            fill="#575B66"
          ></path>
          <path
            d="M892.884656 871.573898c0 7.223986-6.140388 13.003175-13.003175 13.003175l-38.648325 0 0 75.129453 38.648325 0c48.761905 0 88.493827-39.731922 88.493827-88.493827l0-43.705115-75.129453 0L893.245855 871.573898z"
            fill="#575B66"
          ></path>
          <path
            d="M879.520282 631.015168l-152.426102 0c-48.761905 0-88.493827 39.731922-88.493827 88.493827l0 152.426102c0 48.761905 39.731922 88.493827 88.493827 88.493827l38.648325 0L765.742504 884.938272l-38.648325 0c-7.223986 0-13.003175-6.140388-13.003175-13.003175l0-152.426102c0-7.223986 6.140388-13.003175 13.003175-13.003175l152.426102 0c7.223986 0 13.003175 6.140388 13.003175 13.003175l0 33.591534L968.014109 753.100529l0-33.591534C968.014109 670.74709 928.282187 631.015168 879.520282 631.015168z"
            fill="#575B66"
          ></path>
        </svg>
        <p class="title">推广分享</p>
        <svg
          class="icon arrow"
          viewBox="0 0 1024 1024"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M698.181818 546.909091a35.141818 35.141818 0 0 1-24.669091-10.24l-372.363636-372.363636a34.909091 34.909091 0 0 1 49.338182-49.338182l372.363636 372.363636a34.676364 34.676364 0 0 1 0 49.338182 35.141818 35.141818 0 0 1-24.669091 10.24z"
            fill="#666666"
          ></path>
          <path
            d="M325.818182 919.272727a35.141818 35.141818 0 0 1-24.669091-10.24 34.676364 34.676364 0 0 1 0-49.338182l372.363636-372.363636a34.909091 34.909091 0 0 1 49.338182 49.338182l-372.363636 372.363636a35.141818 35.141818 0 0 1-24.669091 10.24z"
            fill="#666666"
          ></path>
        </svg>
        <van-overlay :show="share.show">
          <div class="wrapper" @click.stop="share.show = false">
            <img src="../../../public/images/二维码.png" alt="" />
          </div>
        </van-overlay>
      </div>
      <div class="policy" @click="policy.show = true">
        <svg
          class="icon"
          viewBox="0 0 1024 1024"
          xmlns="http://www.w3.org/2000/svg"
          width="48"
          height="48"
        >
          <path
            d="M170.996 125.72c35.822 11.49 82.282 9.983 139.524-5.643 59.517-16.247 119.876-44.842 181.082-85.96a36 36 0 0 1 39.513-0.418c66.49 42.653 127.344 71.386 182.35 86.373 53.044 14.454 100.03 15.98 141.384 5.11C877.674 119.184 900 136.401 900 160v435.61c0 183.2-128.142 341.438-307.341 379.523-22.62 4.807-45.702 11.141-69.248 19.01a36 36 0 0 1-22.736 0.03c-23.555-7.807-46.622-14.101-69.202-18.892C252.211 937.25 124 778.981 124 595.73V160c0-24.4 23.761-41.732 46.996-34.28zM448.39 632.514v0.001L337.21 509.8c-11.808-12.24-29.03-9.935-40.723 2.425l-27.31 28.872c-2.903 3.069-2.903 8.012 0 11.081l132.025 144.484 0.051-0.055 25.806 27.283 0.211 0.22c11.809 12.24 30.86 12.14 42.553-0.22l285.943-312.967c2.903-3.069 2.903-8.012 0-11.081l-29.082-30.305c-11.809-12.24-29.299-10.927-40.99 1.433L448.39 632.514z"
            fill="#000000"
          ></path>
        </svg>
        <p class="title">隐私政策</p>
        <svg
          class="icon arrow"
          viewBox="0 0 1024 1024"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M698.181818 546.909091a35.141818 35.141818 0 0 1-24.669091-10.24l-372.363636-372.363636a34.909091 34.909091 0 0 1 49.338182-49.338182l372.363636 372.363636a34.676364 34.676364 0 0 1 0 49.338182 35.141818 35.141818 0 0 1-24.669091 10.24z"
            fill="#666666"
          ></path>
          <path
            d="M325.818182 919.272727a35.141818 35.141818 0 0 1-24.669091-10.24 34.676364 34.676364 0 0 1 0-49.338182l372.363636-372.363636a34.909091 34.909091 0 0 1 49.338182 49.338182l-372.363636 372.363636a35.141818 35.141818 0 0 1-24.669091 10.24z"
            fill="#666666"
          ></path>
        </svg>
        <van-overlay :show="policy.show">
          <div class="wrapper" @click.stop="policy.show = false">
            <div class="content">{{ policy.content }}</div>
          </div>
        </van-overlay>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "other-my",
  data() {
    return {
      share: {
        show: false,
      },
      policy: {
        show: false,
        content:
          "钓鱼小达人客户端隐私政策（以下简称'本政策'）帮助您了解以下内容：一、我们如何收集和使用您的个人信息\n\n二、我们如何对外提供您的个人信息\n\n 三、我们如何保护您的个人信息\n\n四、您的权利 五、我们如何处理儿童的个人信息 六、本政策如何更新\n\n七、其他\n\n 八、如何联系我们\n\n我们非常重视用户的隐私和个人信息保护。我们将按照法律法规要求，采取相应的安全保护措施来保护您的个人信息。在使用钓鱼小达人客户端前，请您仔细阅读并了解本政策。若您使用我们的产品和服务，即表示您同意我们在本政策中所述内容。如您有问题，请联系我们。\n\n一、我们如何收集和使用您的个人信息\n\n个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。\n\n在您使用钓鱼小达人客户端的过程中，本客户端会按照如下方式收集您在使用时主动提供或因为使用而产生的个人信息，用以向您提供服务及优化我们的服务：\n\n1、当您使钓鱼小达人客户端时，为使我们的服务正常运行以保障您的正常使用，改进优化您的使用体验，我们会收集您的设备名称、设备型号、MAC地址及IMEI、设备识别码、移动应用列表等软硬件特征信息、操作系统和应用程序版本、语言设置、分辨率、位置等信息，这类信息是为提供服务必须收集的基础信息。\n\n2、当您参与钓鱼小达人客户端的互动留言活动时，需要您完成实名认证才能使用，您需要提供姓名、性别、身份证号码、手机号码等信息。此类信息属于个人敏感信息，我们会严格保护您的个人信息，您可以根据自身需要选择是否参与互动留言活动。\n\n3、当您使用钓鱼小达人客户端下载资源中或客户端用阅读器打开应用文章关联的PDF文件时，会获取设备的存储权限，修改或读取存储卡中的内容。\n\n二、我们如何对外提供您的个人信息\n\n1.为了更全面地为您提供服务，我们会使用专业第三方服务单位提供的软件服务工具包（简称SDK），包括在使用分享功能时所调用的分享SDK（新浪微博、微信、QQ等提供），在浏览网页时所调用的浏览服务SDK（腾讯提供）。这些SDK可能会收集、使用或存储您的个人信息。我们会尽到审慎义务，对所使用SDK的来源进行严格审查。对于第三方SDK收集的信息，由第三方服务单位承担相应责任，详情请查阅第三方服务单位的服务条款及隐私政策。\n\n2.根据相关法律法规及国家标准，在以下情形中，我们可能会共享或公开披露个人信息无需事先征得您的同意：\n\n（1）与国家安全、国防安全直接相关的；\n\n（2）与公共安全、公共卫生、重大公共利益直接相关的；\n\n（3）与刑事侦查、起诉、审判和判决执行等直接相关的；\n\n（4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；\n\n（5）法律法规规定的其他情形。 三、我们如何保护您的个人信息\n\n我们会采取一切合理可行的措施，保护您的个人信息。我们会采取一切合理可行的措施，确保未收集无关的个人信息。四、您的权利按照中国相关的法律、法规、标准，我们保障您对自己的个人信息行使法定权利。\n\n五、我们如何处理儿童的个人信息\n\n钓鱼小达人客户端非常重视对未成年人个人信息的保护。根据相关法律法规的规定，若您是未成年人，在使用钓鱼小达人客户端的服务前，应事先取得您的家长或法定监护人的书面同意。我们不会收集包括未成年人在内的个人信息。尽管当地法律和习俗对儿童的定义不同，但我们将不满14周岁的任何人均视为儿童。\n\n六、本政策如何更新\n\n我们可能会适时对本政策进行修订。当本政策的条款发生变更时，我们会在版本更新时向您展示变更后的《钓鱼小达人网站移动客户端隐私政策》。\n\n七、其他\n\n《钓鱼小达人网站移动客户端用户协议》中所规定的用户权利及信息安全保障措施均适用于钓鱼小达人客户端用户。如《钓鱼小达人网站移动客户端用户协议》与本政策存在不一致或矛盾之处，请以本政策为准。本政策的版权由钓鱼小达人客户端所有，钓鱼小达人客户端保留一切解释和修改权利。\n\n八、如何联系我们\n\n如果您对本政策的相关事宜有任何问题、意见或建议，请发送邮件至【buwangzhan123@163.com】或通过钓鱼小达人官方网站（www.mca.gov.cn）与我们联系。\n\n",
      },
    };
  },
};
</script>

<style lang="less" scoped>
.others {
  padding: 0 0.12rem 0.12rem 0.12rem;
  z-index: 40;
  .other {
    padding: 0.06rem;
    background-color: white;
    border-radius: 0.1rem;
    .share,
    .policy {
      display: flex;
      align-items: center;
      padding: 0.08rem 0;
      gap: 0.08rem;
      .icon {
        width: 0.32rem;
        height: 0.32rem;
      }
      .title {
        font-size: 0.13rem;
      }
      .icon.arrow {
        width: 0.2rem;
        height: 0.2rem;
        margin-left: auto;
      }
      .wrapper {
        display: flex;
        align-items: center;
        justify-content: center;
        height: 100%;
        z-index: 40;
      }
      .block {
        width: 120px;
        height: 120px;
        background-color: #fff;
        z-index: 40;
      }
      img {
        width: 90%;
        height: 85%;
      }
      .content {
        width: 90%;
        height: 50%;
        overflow: scroll;
        background-color: white;
        font-size: 0.14rem;
        white-space: pre-line;
        border-radius: 0.1rem;
        padding: 0.12rem;
      }
    }
    .share {
      border-bottom: 1px solid gainsboro;
    }
  }
}
</style>
